{
  "test": [
    {
      "id": "1",
      "text": "the test ran successfully."
    },
    {
      "id": "2",
      "text": "testing"
    },
    {
      "id": "3",
      "text": "testing123"
    },
    {
      "id": "4",
      "text": "updated"
    },
    {
      "id": "4",
      "text": "updated"
    },
    {
      "id": "4",
      "text": "updated"
    },
    {
      "id": "6",
      "text": "testing"
    },
    {
      "id": "2",
      "text": "testing"
    },
    {
      "id": "10",
      "text": "fixing"
    },
    {
      "id": "11",
      "text": "really fixed"
    },
    {
      "id": "testing",
      "selected": "2024-08-30T15:00:00.000Z",
      "text": "is there class today"
    },
    {
      "id": "2",
      "simple_date": "2024. 8. 31.",
      "text": "test"
    }
  ],
  "schedule": [
    {
      "id": "8c8f",
      "date": "2024. 9. 27.",
      "time": "11:00",
      "length": "1"
    },
    {
      "id": "5b63",
      "date": "2024. 9. 17.",
      "time": "00:01",
      "length": "1"
    },
    {
      "id": "4906",
      "date": "2024. 10. 11.",
      "time": "14:01",
      "length": "1"
    },
    {
      "id": "cedf",
      "date": "2024. 10. 12.",
      "time": "13:01",
      "length": "1"
    },
    {
      "id": "bcf7",
      "date": "2024. 10. 19.",
      "time": "14:01",
      "length": "2"
    },
    {
      "id": "7a4b",
      "date": "2024. 10. 23.",
      "time": "02:12",
      "length": "2"
    }
  ],
  "diary": [
    {
      "date": "2024. 9. 6.",
      "content": "It was a cloudy and rainy day this weekend. Because of the weather, I just stayed at home with my boyfriend. We both like to eat delicious food, so we decided to go grocery market and buy some food materials and cooking together for out lunch. We thought a lot about menu and finally decided to make basil pasta with brie cheese which  was well known for Sung si-kyung’s pasta and the reason why we choose this menu is that it seems like very simple. We  searched Youtube to find the tutorial video and, llist up what we have to buy. And then, we went to the nearest market and bought  pasta materials very quickly. But unfortunately, when we back  home we found we forgot to buy the most important material which was the key for the pasta. Yes we forgot the cheese! But It was too late to go back to the market, it’s almost 2:00 pm. So we changed menu to oil pasta in a hurry. It was almost 3:00 pm when we started eating.  It was a quite hard process but we both were very satisfied with our cooking result. I think we can do better next time.",
      "id": "ca90"
    },
    {
      "date": "2024. 9. 27.",
      "content": "I woke up late today, because it was Saturday. I got up around 9 and had breakfast which was a basil cheese sandwich. And then, I took a shower and got dressed and dried my hair in 30 minutes. Today I had plans with my club members to play tennis in the Mokdong tennis court from 1pm to 3pm which is located near the Mokdong station. Before I went to the tennis court I had to change the tennis racket string which was loose. So I found a tennis string shop near the Mokdong station. I went out at 11 am. Got on the subway and arrived at the tennis shop around 11:30.  The engineer said it takes around 1 hour to change the string so I went to the cafe just behind the tennis shop. I ordered a cup of ice Americano and just surfed the internet while I was waiting. I went back to the tennis shop at 12:40 and got my racket back. After that, I went to the tennis court and played tennis very hard. But unfortunately, It started raining one hour after we started playing tennis. The rain got worse, so we had no choice but to stop the game and go back home.",
      "id": "6876"
    },
    {
      "id": "82cc",
      "date": "2024-09-13",
      "content": "I went skiing with my friends. "
    },
    {
      "id": "41ad",
      "date": "2024-10-11",
      "content": "hellow world!"
    },
    {
      "id": "4f92",
      "date": "2024-10-12",
      "content": "woo"
    },
    {
      "id": "c6ac",
      "date": "2024-10-11",
      "content": "2nd test"
    },
    {
      "id": "7bcc",
      "date": "2024-10-09",
      "content": "소나기가 내리는 날\n"
    },
    {
      "id": "91d1",
      "date": "2024-10-21",
      "content": "weekend\n"
    },
    {
      "id": "e682",
      "date": "2024-10-22",
      "content": "thus"
    },
    {
      "id": "b8f2",
      "date": "2024-10-13",
      "content": "hellow fluent"
    }
  ],
  "quizlet": [
    {
      "date": "2024. 9. 27.",
      "cards": [
        [
          "Today, I played soccer.",
          "오늘은 축구를 했다"
        ],
        [
          "It was fun.",
          "재미있었다"
        ],
        [
          "I want to play again.",
          "또 하고 싶다."
        ]
      ],
      "id": "3a27"
    },
    {
      "date": "2024. 10. 03.",
      "cards": [
        [
          "Today was a holiday.",
          "오늘은 공휴일이었다"
        ],
        [
          "I had no friends.",
          "나는 친구가 없었다"
        ],
        [
          "What a sad day.",
          "슬픈 날이었다."
        ]
      ],
      "id": "6d54"
    }
  ]
}